USE n3_qlCuaHangTienLoi;
GO

INSERT INTO KhachHang (maKH, tenKH, gioiTinh, sdt, ngayTaoTK, diemTichLuy)
VALUES 
('KH00000001', N'Nguyễn Văn An', 0, '0912345678', '2025-11-01', 150),
('KH00000002', N'Trần Thị Bình', 1, '0987654321', '2025-11-05', 300),
('KH00000003', N'Lê Văn Hai', 0, '0909123123', '2025-11-10', 50),
('KH00000004', N'Phạm Thị Duyên', 1, '0933222111', '2025-11-05', 120),
('KH00000005', N'Huỳnh Ngọc My', 1, '0977333444', '2025-11-02', 500),
('KH00000006', N'Võ Văn Trường', 0, '0922113344', '2025-11-02', 250),
('KH00000007', N'Đặng Thị Bình', 1, '0944556677', '2025-11-18', 80),
('KH00000008', N'Phan Văn Thái', 0, '0911999888', '2025-11-02', 100),
('KH00000009', N'Bùi Thị Minh', 1, '0909000111', '2025-11-05', 320),
('KH00000010', N'Lý Minh Thái Kiệt', 0, '0988111222', '2025-11-05', 60);
